books_app/app/controllers/books_controller.rb

INSERT INTO "books" ("title", "memo", "created_at", "updated_at", "author", "picture") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @book = Book.new(book_params)
    respond_to do |format|
      if @book.save

UPDATE "books" SET "picture" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["picture", "34049963883_bd327da71a_b.jpg"], ["updated_at", "2019-11-15 03:58:10.803345"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @book.update(book_params)